package exercise_190401_Advance_03;

//3. 다음과 같은 클래스 구조와 조건을 가진 프로그램을 작성하세요
//   아래에 위치한 클래스는 위의 클래스를 상속 받습니다
//   프로그램을 제작하세요
//      
//
//             Product
//    
//     Book		 CompactDisc
//
//
//  ConversationBook
//


//  객체 지향 개념에 부합하도록 적절한 접근 지정자, 필드, 메서드, 생성자 등을 작성하라.

//<실행>
//메뉴선택
//(1)상품 추가  (2)모든 상품 조회   (3)끝내기
//선택 >> 1
//
//상품 종류
//(1)책  (2)음악CD  (3)회화책
//선택 >> 2
//
//책은 상품설명, 생산자, 가격, 책 제목, 저자, ISBN 정보를 포함한다
//음악은 상품설명, 생산자, 가격, 앨범 제목, 가수 정보를 포함한다
//회화책은 상품설명, 생산자, 가격, 책 제목, 저자, 언어, ISBN 정보를 포함한다

public class Advance_03 {

}
