package exercise_190403;
//2. PhoneBookVer06.java을 수정하세요
//배열을 HashSet<E> 클래스로 바꾸세요
//HashSet<E>클래스에 우리가 만든 클래스를 적용하려면
//hashCode()메서드와 equals()메서드를 오버라이딩해야 합니다.
//
//실행 예시입니다
//
//선택하세요...
//1. 데이터 입력
//2. 데이터 검색
//3. 데이터 삭제
//4. 프로그램 종료
//선택: 1
//데이터 입력을 시작합니다..
//1. 일반,  2. 대학,  3. 회사
//선택>> 1
//이름: 홍길동
//전화번호 : 010-1111-2222
//데이터 입력이 완료되었습니다.
//
//
//선택하세요...
//1. 데이터 입력
//2. 데이터 검색
//3. 데이터 삭제
//4. 프로그램 종료
//선택: 1
//데이터 입력을 시작합니다..
//1. 일반,  2. 대학,  3. 회사
//선택>> 1
//이름: 홍길동
//전화번호 : 010-3333-4444
//이미 저장된 데이터입니다.
//
//
//선택하세요...
//1. 데이터 입력
//2. 데이터 검색
//3. 데이터 삭제
//4. 프로그램 종료
//선택: 

public class Advance_02 {

}
