package exercise_190401;

//3. 다음과 같은 클래스 구조와 조건을 가진 프로그램을 작성하세요
//   아래에 위치한 클래스는 위의 클래스를 상속 받습니다
//   프로그램을 제작하세요
//      
//
//             Product
//    
//     Book		 CompactDisc
//
//
//  ConversationBook
//
//  Product클래스는 각 상품의 고유한 식별자, 상품 설명, 생산자, 가격정보를 포함하고 있다.
//  Book 클래스는 ISBN 번호, 저자, 책 제목 정보를 포함한다.
//  CompactDisc 클래스는 앨범 제목, 가수 이름 정보를 포함한다.
//  ConversationBook은 회화책에서 다루는 언어명 정보를 포함한다.
//  객체 지향 개념에 부합하도록 적절한 접근 지정자, 필드, 메서드, 생성자 등을 작성하라.
//  ProductInfo클래스를 만들고 이곳에 main()을 둔다.
//  main()에서는 최대 10개의 상품을 추가할 수 있으며 모든 상품의 정보를 조회할 수 있다.
//  모든 제품에 대한 정보를 출력할 때 Product타입의 레퍼런스를 이용하라.
//
//
//<실행>
//메뉴선택
//(1)상품 추가  (2)모든 상품 조회   (3)끝내기
//선택 >> 1
//
//상품 종류
//(1)책  (2)음악CD  (3)회화책
//선택 >> 2
//
//책은 상품설명, 생산자, 가격, 책 제목, 저자, ISBN 정보를 포함한다
//음악은 상품설명, 생산자, 가격, 앨범 제목, 가수 정보를 포함한다
//회화책은 상품설명, 생산자, 가격, 책 제목, 저자, 언어, ISBN 정보를 포함한다


public class Advance_03 {
	// exercise_190401_Advance_03 패키지
}
